tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "homebrew/apache"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"

brew "libyaml"
brew "gdbm"
brew "readline"
brew "sqlite"
brew "python"
brew "ansible"
brew "apr"
brew "apr-util"
brew "asciidoc"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "brightness"
# Install GNU core utilities (those that come with macOS are outdated)
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "curl"
brew "direnv"
brew "dnsmasq", restart_service: true
brew "doxygen"
brew "jpeg"
brew "wxmac"
brew "erlang"
brew "elixir"
brew "elm"
brew "perl"
brew "git"
brew "elm-format"
brew "emacs"
brew "ghostscript"
brew "epstool"
brew "freetype"
brew "fontconfig"
brew "fortune"
brew "fwup"
brew "gd"
brew "libxml2"
brew "pcre"
brew "gdal"
brew "gettext"
brew "gifsicle"
brew "lua"
brew "heroku"
brew "htop"
brew "htop-osx"
brew "imagemagick"
brew "jp2a"
brew "jq"
brew "libevent"
brew "libxslt"
brew "lzo"
brew "nmap"
brew "node"
brew "pkg-config"
brew "postgresql", restart_service: true
brew "reattach-to-user-namespace"
brew "redis"
brew "ruby"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "launch_socket_server", restart_service: true
brew "squashfs"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim", args: ["with-override-system-vi"]
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "mysql@5.6"

cask "dropbox"
cask "flux"
cask "imageoptim"
cask "iterm2"
cask "licecap"
cask "ngrok"
cask "slack"
cask "spotify"
cask "telegram-desktop"
cask "transmission"
cask "vlc"
cask 'visual-studio-code'
cask 'android-file-transfer'
cask 'firefox'
cask 'launchrocket'
cask 'sequel-pro'
cask 'istat-menus'
cask 'resilio-sync'
cask 'rambox'
cask 'macpass'